# =====================================================
# FastAPI AI 서버
# - 클라이언트로부터 분석 요청을 받아
# - 길이, 감성, 키워드 탐지 붅석 결과를 반환하는 예제
# =====================================================
from fastapi import FastAPI
from pydantic import BaseModel
from tensorflow.tools.compatibility.ast_edits import AnalysisResult
from transformers import pipeline
import uvicorn

# =====================================================
# 1. 감성 분석 모델 로드
# =====================================================
# Hugging Face의 사전 학습된 모델을 사용
sentiment_analyzer = pipeline("sentiment-analysis")   # 모델 결과 다운로드

# =====================================================
# 2. FAST API 앱 생성
# =====================================================
app = FastAPI(title="AI 분석 서버")

# =====================================================
# 3. 요청 데이터 구조 정의 (Pydantic)
# =====================================================
# 클라이언트가 보낸 json 데이터를 자동 검증 및 파싱
class AnalysisRequest(BaseModel):
    mode: str # 분석 모드 (length/sentiment/keyword)
    text: str # 분석할 문장

# =====================================================
# 4. 분석 API 엔드포인트 정의
# =====================================================
@app.post("/analyzer")
async def analyze(request: AnalysisRequest):
    # 클라이언트로부터 요청값(mode, text) 읽기
    mode = request.mode.lower()
    text = request.text

    # 분석 모듈 작성
    # 1) 문장 길이 분석
    if mode == "sentiment":
        print("")



# =====================================================
# .
# =====================================================


# =====================================================
# .
# =====================================================


# =====================================================
# .
# =====================================================


# =====================================================
# .
# =====================================================

# =====================================================
# .
# =====================================================

# =====================================================
# .
# =====================================================
